/*題目1 :建立兩個大小為10的整數陣列，分別存放學生學號以對應的計概成績。
請使用氣泡排序，將兩個陣列依照計概成績由小到大排序，在印出排序後的結果
(學號、成績)。
id[ ]學號: {12,13,14,15,16,17,19,21,22,23,24,26,27,28,29,31,32,33,36,37}
score[ ]成績: {66,67,66,70,73,74,75,75,62,32,44,46,27,12,80,63,66,90,11,66}*/
#include <stdio.h>
#define SIZE 20

int main() {
	int i, j, temp;
	int id[SIZE] = { 12,13,14,15,16,17,19,21,22,23,24,26,27,28,29,31,32,33,36,37 };
	int score[SIZE] = { 66,67,66,70,73,74,75,75,62,32,44,46,27,12,80,63,66,90,11,66 };
	for (i = 0; i < SIZE - 1; i++) {
		for (j = 0; j < SIZE - 1 - i; j++) {
			if (score[j] > score[j + 1]) {
				temp = score[j];
				score[j] = score[j + 1];
				score[j + 1] = temp;

				temp = id[j];
				id[j] = id[j + 1];
				id[j + 1] = temp;
			}
		}
	}
	printf("學號 成績\n");
	for (int x = 0; x < SIZE; x++) {
		printf("%d   %d\n", id[x], score[x]);
	}
}
